Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དེ་དག་མི་མ་ལགས་ཀྱི་ལྷ་ཚོགས་ལགས་སྙམ་བགྱིད།
en: These are not humans; I think they must be gods.

source: །མེ་ཏོག་མཆོག་ཕྲེང་བྱུག་པ་དར་གྱི་ལྡ་ལྡི་དག །ཀུན་གྱི་ལག་ན་ཐོགས་ནས་གུས་དང་བཅས་པར་སྡོད། །རྒྱལ་པོ་ལྷ་རྣམས་དེ་དག་གཞོན་ནུ་ལྷ་ཡི་ལྷ། ། བལྟ་བར་འཚལ་ཞིང་མཆོད་པའི་སླད་དུ་མཆིས་སུ་ངེས།
en: “They wait respectfully, each of them holding in his hands The choicest flowers, garlands, unguents, and silk. King, it is certain that they have come To see and worship the prince, the God of Gods.”

source: །སོང་སྟེ་ཀུན་ཀྱང་ཕོ་བྲང་ནང་དུ་གཤེགས་ཞེས་གྱིས།
en: “Go invite them all into the palace.

source: །དེ་དག་ཡོན་ཏན་སྤྱོད་ལམ་ཁྱོད་ཀྱིས་སྨྲས་ལྟར་ན།
en: The qualities and behavior you have described,

source: །རྫུ་འཕྲུལ་དེ་འདྲ་བ་ནི་མི་ལ་གང་ཡང་མེད།
en: Such miracles are not made by humans.”

source: །སྒོ་བས་ཐལ་མོ་སྦྱར་ཏེ་ལྷ་ལ་འདི་སྐད་སྨྲས།
en: The gatekeeper joined his palms and spoke to the gods,

source: །རྒྱལ་པོས་གནང་གིས་ཁྱེད་ཅག་ནང་དུ་བཞུད་དུ་གསོལ།
en: “The king invites you all to come inside.”

source: །ལག་ན་ཕྲེང་ཐོགས་དེ་དག་དགའ་མགུ་ཡི་རངས་ཏེ།
en: The gods with garlands in their arms were overjoyed

source: །ལྷ་ཡི་གནས་དང་འདྲ་བའི་རྒྱལ་པོའི་ཁྱིམ་དུ་ཞུགས།
en: And entered the king’s palace, which was similar to the god realm.

source: །ལྷ་མཆོག་དེ་དག་ཁྱིམ་དུ་ཕྱིན་པར་མཐོང་ནས་ནི།
en: Seeing these supreme gods enter his palace,

source: །རྒྱལ་པོ་སྟན་ལས་ལངས་ཏེ་ཐལ་མོ་སྦྱར་བྱས་ནས།
en: The king rose from his seat and joined his palms.

source: །རིན་ཆེན་རྩ་བ་ཅན་གྱི་ཁྲི་གདན་བཤམས་པ་འདིར།
en: “These thrones with jeweled legs have been arranged here.

source: །ཐུགས་བརྩེ་མཛད་པའི་ཐུགས་ཀྱིས་ཁྱེད་ཅག་བཞུགས་སུ་གསོལ།
en: Please, with your great benevolence, kindly take your seats.”

source: །ང་རྒྱལ་དྲེགས་མེད་དེ་དག་སྟན་ལ་འཁོད་པར་གྱུར།
en: Then, without pride or haughtiness, the gods took their seats.

source: །བདག་ཅག་ཅི་སླད་འདིར་མཆིས་རྒྱལ་པོ་གསན་དུ་གསོལ།
en: “King, please listen to our reason for coming here.

source: །ཁྱོད་སྲས་རྣམ་དག་སྐུ་མངའ་བསོད་ནམས་ཆེན་པོ་བལྟམ། །ཤིན་ཏུ་ལེགས་པའི་ཞབས་ལྡན་བདག་ཅག་མཐོང་བར་འཚལ།
en: A child, whose body is pure and who has great merits, has been born to you; We wish to see his honored person.

source: །གང་གི་འགྲོ་བ་གང་དང་སྦྱོར་བ་གང་ཅིར་འགྱུར། །མཚན་བཟང་མཚན་གྱི་ཆོ་ག་དག་ནི་བདག་ཅག་འཚལ།
en: “We know the significance of excellent marks; We know what they mean, their course and their application.

source: །དེ་བས་རྒྱལ་པོའི་དམ་པ་མི་དགྱེས་སྤང་བར་མཛོད།
en: Thus, sublime king, do not feel sad;

source: །སྣ་ཚོགས་མཚན་གྱིས་ཡན་ལག་བརྒྱན་པ་བལྟ་བར་འཚལ།
en: We wish to see the one who has these many marks.

source: །རྒྱལ་པོ་བུད་མེད་ཚོགས་ཀྱིས་བསྐོར་བ་དེ་རབ་དགའ།
en: The king, surrounded by the women of the palace, was filled with joy,

source: །གཞོན་ནུ་མེ་ཡི་འོད་ལྟར་འབར་བ་པང་དུ་བླངས།
en: And he took the prince, blazing like a fire, on his lap.

source: །ལྷ་མཆོག་གཙུག་ཕུད་འཕྱང་བ་དག་ནི་ཉེ་བར་བསྙེན།
en: The supreme gods, with flowing hair, approached;

source: །ཐོག་མ་སྒོར་བྱུང་སྟོང་གསུམ་འདི་དག་ཀུན་ཏུ་གཡོས།
en: Just when they emerged from the door, the whole trichiliocosm trembled.

source: །ལྷ་མཆོག་དེ་དག་འདྲེན་པའི་ཞབས་དང་སེན་མོ་ནི།
en: When the supreme gods saw the Leader’s feet and nails,

source: །ཟངས་མདོག་དྲི་མེད་རྣམ་དག་གཟི་བརྗིད་ལྡན་མཐོང་ནས།
en: Copper colored, stainless, pure, and majestic,

source: །གཙུག་པུད་འཕྱང་བ་དེ་དག་མྱུར་དུ་ལངས་པར་གྱུར།
en: Those gods with their flowing hair quickly stood and prostrated,

source: །དྲི་མ་མེད་པའི་འོད་ཀྱིས་ཞབས་ལ་མགོས་ཕྱག་འཚལ།
en: Placing their heads at the feet of the one with stainless brilliance.

source: །འདི་འདྲའི་མཚན་དང་འདི་འདྲར་ལྟ་བ་དཔལ་ཅན་དང་། །འདི་འདྲའི་བསོད་ནམས་གཟི་བརྗིད་སྤྱི་གཙུག་མི་མཐོང་དང་། །མཛོད་སྤུ་ནས་ནི་རྒྱ་ཆེན་འོད་འབྱུང་འདི་འདྲ་ལས།
en: Because of these marks and the glory that they show, As well as the splendor of merit and the unseen crown of his head, And also because of the light that shines from the tuft of hair on his forehead,

source: །བདུད་རྣམས་ཕམ་མཛད་བྱང་ཆུབ་བརྙེས་འགྱུར་གདོན་མི་འཚལ།
en: It is certain that he will conquer Māra and find awakening.

source: །མུན་སེལ་ཉོན་མོངས་བྲལ་བའི་ཡོན་ཏན་བརྟགས་ནས་སུ།
en: The gods praised the prince, saying, “He is free from the darkness of disturbing emotions;

source: །ཡང་དག་ཡོན་ཏན་ཇི་ལྟར་དོན་མཐོང་དེ་ལ་བསྟོད།
en: He is full of qualities and is able to see things, just as they are. This jewel among men has finally appeared—

source: །སྐྱེ་དང་རྒ་དང་འཆི་དང་ཉོན་མོངས་དགྲ་བསལ་བའི། །སེམས་ཅན་རིན་ཆེན་འདི་ནི་རིང་པོར་མི་ཐོགས་འབྱུང་།
en: The one who has conquered the enemies of birth, old age, death, and disturbing emotions.

source: །ཡོངས་རྟོག་འདོད་ཆགས་ཡུལ་གྱི་གཙུབ་མས་བསྐྱེད་པ་ཡི། །རྣམ་གསུམ་མེས་ནི་སྲིད་གསུམ་ཀུན་འབར་ཡོངས་གདུངས་པར།
en: “Stirred by objects of desire and imagination, three fires are born, Setting the three existences ablaze and causing deep torment.

source: །དཔལ་ཁྱོད་ཆོས་ཀྱི་སྤྲིན་གྱིས་སྟོང་གསུམ་བཀང་ནས་ནི།
en: Yet you, a heroic cloud of Dharma, will aid the tormented by filling the trichiliocosm

source: །འཆི་མེད་ཆར་གྱིས་ཉོན་མོངས་གདུང་བ་ཞི་མཛད་འགྱུར།
en: With a rain of the nectar of immortality to calm the suffering of negative emotions.

source: །བྱམས་པའི་གསུང་མངའ་ཐུགས་རྗེ་ལྡན་པ་འཇམ་པའི་གསུང་།
en: “With a loving voice and soft, compassionate speech,

source: །ཚངས་པའི་སྒྲ་དབྱངས་ཡིད་འོང་གསུང་དུ་སྒྲོག་མཛད་པ།
en: You will call out with the delightful strains of Brahmā’s voice,

source: །སྟོང་གསུམ་ཀུན་ཏུ་གོ་ཞིང་འགྲོ་བ་གོར་འགྱུར་བ།
en: Heard in all three realms and by all beings.

source: །བཅོམ་ལྡན་ཁྱོད་ཀྱིས་སངས་རྒྱས་གསུང་ཆེན་མྱུར་དུ་སྒྲོགས། །སྲིད་པའི་འདོད་ཆགས་བཅིངས་བྱིང་སྲིད་པའི་རྩེར་གནས་པ། །མུ་སྟེགས་ཅན་གྱི་ཚོགས་ངན་ལོག་པར་ལྟ་བ་བཅོམ།
en: Blessed One, quickly call out with the great speech of a buddha! “You will conquer the evil hordes of extremists with mistaken views, Who are caught up in worldly desire and who remain on the peak of existence.

source: །ཁྱོད་ཀྱི་རྒྱུ་ལ་བརྟེན་དང་སྟོང་པའི་ཆོས་ཐོས་ནས།
en: Hearing your doctrine of emptiness and interdependent causality,

source: །སེང་གེས་ཝ་ཚོགས་བཞིན་དུ་དེ་དག་འབྱེར་བར་འགྱུར།
en: They will scatter like jackals before a lion!

source: །ཉོན་མོངས་ཆེན་པོའི་དུ་བ་མ་རིག་བསྒྲིབས་བསལ་ཏེ།
en: “You clear away the obscuration of ignorance, the haze of the great disturbing emotions;

source: །ཀུན་ཏུ་བྱུང་བ་སྐྱེ་བོ་ངེས་པར་སྣང་བྱེད་པའི།
en: You appear and manifest for the sake of beings.

source: །ཡེ་ཤེས་འོད་འཕྲོ་ཤེས་རབ་འོད་རིག་གཟིགས་པ་ཡིས།
en: You, the shining light of wisdom, the light rays of insight,

source: །འགྲོ་བ་ཀུན་གྱི་མུན་པ་ཆེན་པོ་བསལ་བར་གསོལ།
en: May you dispel the great darkness of all beings with your gaze!

source: །གང་དུ་སེམས་ཅན་དག་པ་རྨད་བྱུང་འདི་འདྲ་བྱུང་།
en: “When such an amazing pure being as this appears,

source: །ལྷ་དང་མི་རྣམས་ཀྱིས་ནི་རྙེད་པ་རྒྱ་ཆེན་ཐོབ།
en: Gods and humans acquire a tremendous boon.

source: །རྣམ་པར་རྟོགས་པར་མཛད་པའི་སེམས་ཅན་རིན་ཆེན་འདིས།
en: This precious being, who grants awakening,

source: །ངན་སོང་ལམ་བཅད་ལྷ་ཡི་ལམ་ནི་གཏོད་པར་འགྱུར།
en: Will cut the path to the lower realms and open the paths of the gods!”

source: །སེར་སྐྱའི་གནས་སུ་ལྷ་ཡི་མེ་ཏོག་ཆར་ཕབ་ནས།
en: The gods strewed a rain of divine flowers over Kapilavastu,

source: །བསྐོར་བ་བྱས་ཏེ་གུས་པར་བསྟོད་པ་བྱས་ནས་ནི།
en: Then they circled and praised the Bodhisattva,

source: སངས་རྒྱས་སངས་རྒྱས་ལེགས་ཞེས་དེ་དག་ཚིག་རྗོད་ཅིང་།
en: Calling out, “This is the Buddha, the excellent Buddha!”

source: །ལྷ་ཚོགས་དེ་དག་ཚུལ་དུ་ཤིས་པར་མཁའ་ལས་དོང་།
en: Before departing joyfully up through the sky.

source: །བལྟམ་པའི་ལེའུ་སྟེ་བདུན་པའོ།། །།
en: This concludes the seventh chapter, on the birth.

source: དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་གང་གི་ནུབ་མོ་བཙས་པ་དེ་ཉིད་ཀྱི་ནུབ་མོ་རྒྱལ་རིགས་དང་། བྲམ་ཟེ་དང་། ཁྱིམ་བདག་གི་རིགས་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་རྣམས་སུ་བུ་མོ་ཉི་ཁྲི་བཙས་པར་གྱུར་ཏེ།
en: Monks, on the very evening of the Bodhisattva’s birth, there were twenty thousand girls born among the ruling class, the priestly class, the merchants, and the householders, such as the landowners.

source: དེ་དག་ཐམས་ཅད་ཀྱང་དེ་དག་གི་ཕ་མ་རྣམས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཕུལ་ལོ།
en: All of them were offered to the Bodhisattva by their parents to serve and honor him.

source: །རྒྱལ་པོ་ཟས་གཙང་མས་ཀྱང་བུ་མོ་ཉི་ཁྲི་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་ཕུལ་ལོ།
en: King Śuddhodana also gave twenty thousand girls to the Bodhisattva to serve and honor him.

source: །མཛའ་བཤེས་དང་། བློན་པོ་དང་། ཉེ་དུ་དང་། སྣག་གི་གཉེན་མཚམས་དག་གིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་བྱ་བ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བུ་མོ་ཉི་ཁྲི་ཕུལ་ལོ།
en: His friends, his ministers, his kinfolk, and his blood relatives also offered twenty thousand girls to serve and honor the Bodhisattva.

source: །བློན་པོའི་འཁོར་རྣམས་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ལ་རིམ་གྲོ་དང་། བསྙེན་བཀུར་བྱ་བའི་ཕྱིར་བུ་མོ་ཉི་ཁྲི་ཕུལ་ལོ།
en: Finally the members of ministerial assemblies also offered twenty thousand girls to serve and honor the Bodhisattva.

source: །དགེ་སློང་དག་དེའི་ཚེ་ཤཱཀྱའི་རྒན་རབས་རྒན་རབས་རྣམས་འདུས་ནས། རྒྱལ་པོ་ཟས་གཙང་མ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། གཞོན་ནུ་འདི་ནི་ལྷ་ཁང་དུ་བཀུར་བར་བགྱིའོ། །
en: Monks, at that time the male and female elders of the Śākya clan gathered and said to King Śuddhodana, “King, please pay heed. The prince should now worship in the temple.”

source: རྒྱལ་པོས་སྨྲས་པ། གཞོན་ནུ་དེ་ལྟར་བཀུར་བ་ལེགས་ཀྱིས་དེ་བས་ན་གྲོང་ཁྱེར་ནི་བརྒྱན་པར་གྱིས་ཤིག །སྲང་དང་། ལམ་གྱི་བཞི་མདོ་དང་། སུམ་མདོ་དང་། ཚོང་འདུས་དག་ནི་མཛེས་པར་གྱིས་ཤིག །བཀྲ་མི་ཤིས་པ་སྒུར་པོ་དང་། ཞར་བ་དང་། འོན་པ་དང་། ལྐུགས་པ་དང་། དབྱིབས་མི་མཛེས་པ་དང་དབང་པོ་མ་ཚང་བ་རྣམས་ནི་སོལ་ཅིག །བཀྲ་ཤིས་པ་རྣམས་ཀྱང་སོགས་ཤིག །
en: King Śuddhodana replied, “Yes, it would be excellent for him to worship in this way. Therefore, let the city be decorated! Ornament the streets, crossroads, intersections, and marketplaces. Send away all the hunchbacks and all the blind, deaf, and mute people, as well as anyone who is deformed or crippled. Gather everything auspicious!

source: བསོད་ནམས་ཀྱི་རྔ་ནི་རྡུངས་ཤིག །བཀྲ་ཤིས་ཀྱི་དྲིལ་ནི་དཀྲོལ་ཅིག །གྲོང་ཁྱེར་དམ་པའི་སྒོ་ནི་རྒྱན་གྱིས་ལེགས་པར་སྤུད་ཅིག །རོལ་མོ་སིལ་སྙན་དང་ཕེག་བརྡབ་པ་ཤིན་ཏུ་ཡིད་དུ་འོང་བ་དག་ནི་ལོང་ཞིང་རྡོབས་ཤིག །ཁམས་ཀྱི་རྒྱལ་པོ་ཐམས་ཅད་ནི་སོགས་ཤིག །ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། བློན་པོ་དང་། སྒོ་བ་དང་། འཁོར་གྱི་མི་དག་ནི་གཅིག་ཏུ་སྡུས་ཤིག །བུ་མོའི་ཤིང་རྟ་ནི་ཤོམས་ཤིག །བུམ་པ་གང་བ་རྣམས་ནི་སྙེན་ཅིག །བྲམ་ཟེ་ཁ་ཏོན་པ་རྣམས་ནི་སྡུས་ཤིག །ལྷ་ཁང་རྣམས་ནི་ཤིན་ཏུ་བརྒྱན་པར་གྱིས་ཤིག །
en: Beat the drums of merit and ring the bells of auspiciousness. Ornament the gates of this excellent city. Play the most pleasant instruments, cymbals, and drums. Assemble all the local lords and gather the merchants, householders, ministers, gatekeepers, and all the local people. Prepare chariots for the girls. Procure brimming vases. Gather the priests who are experts in recitation. Ornately decorate the temples.”

source: དགེ་སློང་དག་དེ་ནས་རྒྱལ་པོས་ཇི་སྐད་བསྒོ་བ་དེ་བཞིན་དུ་ཐམས་ཅད་སྦྱར་བ་དང་། དེ་ནས་རྒྱལ་པོ་ཟས་གཙང་མ་རང་གི་ཁྱིམ་དུ་སོང་ནས་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གོའུ་ཏ་མཱི་ལ་བོས་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Monks, everyone followed the commands issued by the king. Then King Śuddhodana went to his home and spoke to Mahāprajāpatī Gautamī, saying, “The prince is to pray in the temple. Ornament him well.”

source: །གཞོན་ནུ་ལྷ་ཁང་དུ་བཀུར་གྱིས་རྒྱན་གྱིས་ལེགས་པར་བརྒྱན་པར་གྱིས་ཤིག །ལེགས་སོ་ཞེས་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གོའུ་ཏ་མཱིས་དེ་ལྟར་མཉན་ཏེ། གཞོན་ནུ་རྒྱན་གྱིས་བརྒྱན་ཏོ།
en: Mahāprajāpatī Gautamī replied, “Of course,” and dressed the prince lavishly.

source: །དེ་ནས་གཞོན་ནུ་དེ་རྒྱན་གྱིས་བརྒྱན་པའི་ཚེ། བཞིན་འཛུམ་ཞིང་ཁྲོ་གཉེར་མེད་པས་ཤིན་ཏུ་ཡིད་དུ་འོང་བའི་ཚིག་གིས་སྲུ་མོ་ལ་སྨྲས་པ།
en: While the prince was being dressed, with a slight smile and no hint of annoyance, he spoke these pleasant words to his maternal aunt:

source: མ་བདག་གང་དུ་བཀུར།
en: “Mother, where are you taking me?”

source: སྨྲས་པ། བུ་ལྷ་ཁང་དུ་བཀུར་རོ།
en: She replied, “Son, I am taking you to the temple.”

source: །དེ་ནས་གཞོན་ནུས་བཞིན་འཛུམ་སྟེ་བགད་ནས་སྲུ་མོ་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The prince then smiled, laughed, and spoke these verses to his maternal aunt:

source: བདག་བཙས་དེ་ཚེ་སྟོང་གསུམ་འདི་ནི་གཡོས་པར་གྱུར།
en: “When I was born, this trichiliocosm trembled.

source: །བརྒྱ་བྱིན་ཚངས་པ་ལྷ་མིན་ལྟོ་འཕྱེ་ཆེན་པོ་དང་། །ཉི་ཟླ་དེ་བཞིན་རྣམ་ཐོས་བུ་དང་གཞོན་ནུ་ཡང་།
en: Śakra, Brahmā, the demigods, the mahoragas, Sūrya, and Candra, as well as Vaiśravaṇa and Kumāra,

source: །སྤྱི་བོས་རྐང་པ་གཉིས་ལ་གཏུགས་ཏེ་ཕྱག་འཚལ་ན།
en: All bowed their heads to my feet and paid homage to me.

source: །དེ་རིང་མ་ཡིས་གང་དུ་བདག་བཀུར་བགྱི་བ་ཡི། །ལྷ་གཞན་བདག་གི་གོང་ན་འཕགས་པ་གང་ཞིག་མཆིས།
en: “What other god is there who is superior to me, Who my mother takes me to worship today?

source: །ལྷ་རྣམས་ཀུན་ལས་བདག་འཕགས་ལྷ་ཡི་ལྷ་ལགས་ཏེ།
en: I am superior to all the gods; I am the God of Gods.

source: །བདག་འདྲའི་ལྷ་ཡང་མ་མཆིས་གོང་མ་ག་ལ་མཆིས།
en: There is no other god like me, so how could anyone be superior?

source: །འོན་ཀྱང་འཇིག་རྟེན་རྗེས་བསྙག་ཙམ་དུ་བདག་མཆིའོ།
en: “Still, mother, I will follow worldly customs;

source: །བདག་གི་རྣམ་འཕྲུལ་སྐྱེ་བོས་མཐོང་ན་དགར་འགྱུར་ཞིང་།
en: When beings see my miraculous displays, they will be pleased.

source: །རིམ་གྲོ་བཀུར་སྟི་ཤིན་ཏུ་ཆེ་བར་བགྱིད་འགྱུར་ལ།
en: It will inspire them with great respect,

source: །ལྷ་མིས་འདི་ནི་ལྷ་ཡི་ལྷ་ཞེས་རིག་པར་འགྱུར།
en: And gods and humans will know that I am the God of Gods.”

source: །དགེ་སློང་དག་དེ་ལྟར་གྲོང་ཁྱེར་དུ་གཞོན་ནུའི་ཤིང་རྟ་བཤམས་ཏེ་རྒྱན་གྱིས་བརྒྱན་ནས།
en: Monks, once the main streets, crossroads, intersections, and markets had been richly ornamented, with praises and benedictions of all kinds posted around the city, a richly ornamented chariot was prepared for the prince in the inner courtyard.

source: བཀྲ་ཤིས་ཐམས་ཅད་བཤམས་ཏེ་རྒྱལ་པོ་ཟས་གཙང་མས་གཞོན་ནུ་པང་དུ་བླངས་ནས།
en: With all auspicious circumstances having been arranged in this manner, King Śuddhodana lifted the prince onto his lap.

source: བྲམ་ཟེ་དང་། གྲོང་རྡལ་པ་དང་། ཚོང་དཔོན་དང་། ཁྱིམ་བདག་དང་། བློན་པོ་དང་། ཁམས་ཀྱི་རྒྱལ་པོ་དང་། སྒོ་བ་དང་། འཁོར་གྱི་མི་དང་། མཛའ་བཤེས་དང་། ཉེ་དུས་བསྐོར་ཏེ། སྲང་དང་། ལམ་གྱི་བཞི་མདོ་དང་། སུམ་མདོ་དང་། ཚོང་འདུས་རྒྱན་ཚད་མེད་པས་བརྒྱན་པ་དག་ནས་བདུག་སྤོས་དྲི་ཞིམ་པོས་ནི་བདུགས། མེ་ཏོག་སིལ་མ་ནི་གཏོར། རྟ་དང་གླང་པོ་ཆེ་དང་། ཤིང་རྟ་དང་། རྐང་ཐང་གི་བུན་ལོང་ནི་ཆེར་གྱུར། གདུགས་དང་རྒྱལ་མཚན་དང་། བ་དན་ནི་བསྒྲེང་། སིལ་སྙན་སྣ་ཚོགས་ཀྱི་སྒྲ་ནི་ཕྱུང་སྟེ། སོང་བར་གྱུར་ཏོ། །
en: Surrounded by priests, townspeople, merchants, householders, ministers, local lords, gatekeepers, local people, friends, and kinfolk, they traveled through the richly ornamented roads, intersections, crossroads, and marketplaces, which were enveloped in the fragrant scent of incense and strewn with flower petals, filled with horses, elephants, chariots, and foot soldiers, with parasols, victory banners, and flags held aloft, and resounding with many instruments.

source: དེའི་ཚེ་ལྷ་བརྒྱ་སྟོང་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་ཤིང་རྟ་དྲངས་ཏེ།
en: At that time a hundred thousand gods led the Bodhisattva’s chariot.

source: ལྷའི་བུ་མོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་ནམ་མཁའི་དཀྱིལ་ནས་མེ་ཏོག་གི་ཆར་ཕབ་སྟེ། སིལ་སྙན་གྱི་སྒྲ་འབྱིན་པར་གྱུར་ཏོ།
en: Many hundreds of millions of gods and maidens scattered flowers from the sky above and played cymbals.

source: །དགེ་སློང་དག་དེ་ལྟར་རྒྱལ་པོ་ཟས་གཙང་མས་རྒྱལ་པོའི་བཀོད་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་ཕུན་སུམ་ཚོགས་པ་ཆེན་པོ་དང་། རྒྱལ་པོའི་བྱིན་ཆེན་པོས་གཞོན་ནུ་དེ་ཁྱེར་ཏེ་ལྷ་ཁང་དུ་ཕྱིན་ཏོ།
en: Monks, King Śuddhodana, accompanied by the great royal procession, splendor, and ceremony, brought the prince to the temple.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་ལྷ་ཁང་དེར་རྐང་པ་གཡས་པའི་མཐིལ་བཞག་པ་དང་། །དེ་ནས་ལྷའི་གཟུགས་སེམས་མེད་པ་དེ་དག་འདི་ལྟ་སྟེ། གུ་ལང་དང་། སྐེམ་བྱེད་དང་། ལུས་ངན་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། རྣམ་ཐོས་ཀྱི་བུ་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ལ་སོགས་པའི་གཟུགས་ཐམས་ཅད་ཀྱང་རང་རང་གི་གནས་ནས་ལངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་རྐང་པ་ལ་ཕྱག་འཚལ་བར་གྱུར་ཏོ།
en: As soon as the Bodhisattva placed his right foot in the temple, the insentient statues of the gods, such as Śiva, Skanda, Nārāyaṇa, Kubera, Candra, Sūrya, Vaiśravaṇa, Śakra, Brahmā, and the guardians of the world, all stood up from their seats and prostrated at the Bodhisattva’s feet.

source: །དེའི་ཚེ་ལྷ་དང་མི་བརྒྱ་སྟོང་ནི་ཀྱེ་མ་ཨ་ལ་ལ་ཞེས་བྱ་བ་དང་། ཅ་ཅོ་དང་། ག་ཞའི་སྒྲ་བརྒྱ་སྟོང་མང་པོ་འབྱིན་པར་གྱུར་ཏོ།
en: Right then a hundred thousand gods and humans cried out in amazement and delight.

source: །སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་དམ་པ་དེ་ཐམས་ཅད་ཀྱང་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ།
en: The fine city of Kapilavastu trembled in six ways.

source: །ལྷའི་མེ་ཏོག་གི་ཆར་ཡང་མངོན་པར་བབ་བོ། །ལྷའི་སིལ་སྙན་བརྒྱ་སྟོང་དུ་མ་དག་ཀྱང་མ་དཀྲོལ་བར་སྒྲ་འབྱིན་པར་གྱུར་ཏོ། །ལྷ་གང་དག་གི་གཟུགས་གང་ཡིན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རང་རང་གི་གཟུགས་བསྟན་ནས། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲ་བར་གྱུར་ཏོ།
en: A rain of divine flowers fell, and a hundred thousand divine instruments sounded without even being played. Then the various statues in the temple all returned to their seats and spoke these verses:

source: །རི་རྒྱལ་རི་མཆོག་རི་རབ་ནམ་ཡང་ཡུངས་ཀར་འབྲུ་ལ་ཕྱག་མི་འཚལ།
en: “Mount Meru, the greatest and best of mountains, would never bow down to a mustard seed;

source: །རྒྱ་མཚོ་ཀླུ་རྗེ་གནས་ནི་ནམ་ཡང་བ་རྗེས་ཆུ་ལ་ཕྱག་མི་འཚལ།
en: The great ocean, the nāga king’s abode, would never bow down to a puddle;

source: །ཉི་ཟླ་འོད་བྱེད་སྲིན་བུ་མེ་ཁྱེར་འོད་བྱེད་དེ་ལ་ཕྱག་མི་འཚལ།
en: The brilliant sun and moon would never bow down before a firefly.

source: །བསོད་ནམས་ཤེས་རབ་རིགས་བྱུང་ལེགས་ལྡན་ལྷ་རྣམས་གང་ལའང་ཕྱག་མི་བཞེས།
en: So how could the Noble One, with merit and wisdom, bow down before the gods?

source: །ཡུངས་འབྲུ་བ་རྗེས་ཆུ་དང་སྲིན་བུ་མེ་ཁྱེར་འདྲ་བར་གྱུར་པ་ནི། །སྟོང་གསུམ་འདི་ན་ལྷ་མི་གང་ཡང་རུང་སྟེ་ང་རྒྱལ་གནས་པ་ལགས།
en: “The gods and humans of this trichiliocosm Are like mustard seeds, puddles, and fireflies, and yet filled with pride.

source: །རི་རབ་རྒྱ་མཚོ་ཉི་ཟླ་འདྲ་བ་འཇིག་རྟེན་རང་བྱུང་དམ་པ་སྟེ།
en: If the world bows to He Who Is like Mount Meru, the Ocean, the Sun, and the Moon—

source: །དེ་ལ་འཇིག་རྟེན་ཕྱག་འཚལ་བ་ནི་མཐོ་རིས་མྱ་ངན་འདས་པ་འཐོབ།
en: The self-arisen sublime one of this world—then they would attain heaven and nirvāṇa.”

source: །བྱང་ཆུབ་སེམས་དཔའ་ལྷ་ཁང་དུ་ཞུགས་པ་དེ་བསྟན་པའི་ཚེ། ལྷའི་བུ་བརྒྱ་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པར་གྱུར་ཏོ།
en: Monks, when the Bodhisattva entered the temple, three million two hundred thousand gods gave rise to the intention to attain unexcelled, perfect, and complete awakening.

source: །དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔའ་ལྷ་ཁང་དུ་ཁྱེར་བའི་ཚེ་བཏང་སྙོམས་སུ་བཞག་པའི་རྐྱེན་ནི་དེ་ཡིན། རྒྱུ་ནི་དེ་ཡིན་ནོ།
en: Monks, these are the circumstances and causes related to the Bodhisattva’s equanimity as he was brought to the temple.

source: །ལྷ་ཁང་དུ་ཁྱེར་བའི་ལེའུ་སྟེ་བརྒྱད་པའོ།། །།
en: This concludes the eighth chapter, on going to the temple.

source: དགེ་སློང་དག་དེ་ནས་བྲམ་ཟེ་མདུན་ན་འདོན་འཆར་པོ་ཞེས་བྱ་བ་འཆར་འགྲོའི་ཕ། བྲམ་ཟེ་ལྔ་བརྒྱ་ཙམ་གྱིས་བསྐོར་ཏེ། སྐར་མ་མེ་བཞི་འདས་ནས་ནག་པ་ལ་བབ་པའི་ཚེ་རྒྱལ་པོ་ཟས་གཙང་མའི་དྲུང་དུ་ཕྱིན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མཁྱེན་པར་མཛད་དུ་གསོལ། ད་ནི་གཞོན་ནུའི་རྒྱན་མཛད་པའི་རིགས་སོ།
en: Monks, at the time of the constellation of Citrā, after the constellation of Hastā had passed, the chief priest of the king, who was called Udayana, the father of Udāyin, went before King Śuddhodana surrounded by some five hundred priests and said, “Your Majesty, please know that it is now proper for ornaments to be made for the prince.”

source: །རྒྱལ་པོས་སྨྲས་པ། ལེགས་ཀྱིས་བྱེད་དུ་ཆུག་ཤིག །
en: The king replied, “Very well, then do it.”

source: དེའི་ཚེ་རྒྱལ་པོ་ཟས་གཙང་མ་དང་། ཤཱཀྱ་ལྔ་བརྒྱ་ཙམ་གྱིས། རྒྱན་གྱི་རྣམ་པ་ལྔ་བརྒྱ་ཙམ་བྱེད་དུ་བཅུག་སྟེ།
en: At that time King Śuddhodana had five hundred types of ornaments made by five hundred Śākyas.

source: འདི་ལྟར་ལག་པའི་རྒྱན་དག་དང་། རྐང་པའི་རྒྱན་དག་དང་། མགོའི་རྒྱན་དག་དང་། མགུལ་གྱི་རྒྱན་དག་དང་། སོར་གདུབ་དག་དང་། རྣ་རྒྱན་དག་དང་། དཔུང་རྒྱན་དག་དང་། གསེར་གྱི་སྐ་རགས་དག་དང་གསེར་སྐུད་དག་དང་། དྲིལ་བུ་གཡེར་ཀའི་དྲ་བ་དག་དང་། རིན་པོ་ཆེའི་དྲ་བ་དག་དང་། ལྷམ་རིན་པོ་ཆེས་སྤྲས་པ་དག་དང་། དོ་ཤལ་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་དག་དང་། གདུ་བུ་རྒྱན་ཅན་དག་དང་། མགུལ་གདུབ་དག་དང་། ཅོད་པན་དག་ཀྱང་བྱེད་དུ་བཅུག་སྟེ་ཟིན་ནས།
en: He commissioned bracelets, anklets, crowns, necklaces, rings, earrings, armbands, golden belts, golden threads, nets of bells, nets of gems, shoes bedecked with jewels, garlands adorned with various gems, jeweled bangles, chokers, and diadems.

source: སྐར་མ་རྒྱལ་དང་ལྡན་པའི་ཚེ། ཤཱཀྱ་དེ་དག་རྒྱལ་པོ་ཟས་གཙང་མའི་དྲུང་དུ་དོང་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་གཞོན་ནུ་བརྒྱན་དུ་གསོལ།
en: When the ornaments were completed the Śākyas went before King Śuddhodana at the time of the constellation of Puṣya and said, “King, please ornament the prince.”

source: རྒྱལ་པོས་སྨྲས་པ། ཁྱེད་ཀྱིས་གཞོན་ནུ་ལ་བརྒྱན་པ་དང་། མཆོད་པ་བྱས་པས་ཆོག་གིས། ངས་གཞོན་ནུའི་རྒྱན་ཐམས་ཅད་བྱེད་དུ་བཅུག་གོ།
en: The king replied, “It is better if you ornament the prince and make these offerings to him, since I have commissioned the ornaments for the prince.”

source: །སྨྲས་པ། བདག་ཅག་གི་རྒྱན་འདི་དག་གཞོན་ནུའི་སྐུ་ལ་གདུགས་མཚན་བདུན་ཞིག་གདགས་སུ་གསོལ།
en: They replied, “The prince should wear these ornaments that we have made for seven days and nights.

source: དེ་ལྟར་གནང་ན་བདག་ཅག་གིས་སུག་ལས་བགྱིས་པ་ཡང་དོན་མཆིས་པར་འགྱུར་རོ།
en: This will make our efforts meaningful.”

source: །དེའི་ཚེ་ནམ་ལངས་ཏེ་ཉི་མ་ཤར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྐྱེད་མོས་ཚལ་བཀོད་པ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་དེར་ཞུགས་སོ། །དེའི་ཚེ་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གོའུ་ཏ་མཱིས་བྱང་ཆུབ་སེམས་དཔའ་པང་དུ་བླངས་སོ།
en: At dawn, as the sun rose, the Bodhisattva entered the park known as Stainless Array, where Mahāprajāpatī Gautamī took him onto her lap.

source: །བུད་མེད་བརྒྱད་ཁྲིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་བསུ་སྟེ་གདོང་དུ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Eighty thousand women welcomed the Bodhisattva and gazed at his countenance.

source: །བུ་མོ་སྟོང་ཕྲག་བཅུས་བྱང་ཆུབ་སེམས་དཔའ་བསུ་སྟེ། གདོང་དུ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Ten thousand girls welcomed the Bodhisattva and gazed at his countenance.

source: །ཤཱཀྱ་སྟོང་ཕྲག་བཅུས་བྱང་ཆུབ་སེམས་དཔའ་བསུ་སྟེ་གདོང་དུ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Ten thousand Śākyas welcomed the Bodhisattva and gazed at his countenance.

source: །བྲམ་ཟེ་ལྔ་སྟོང་ཡང་ལྷགས་ནས་བྱང་ཆུབ་སེམས་དཔའི་གདོང་དུ་ལྟ་ཞིང་འཁོད་པར་གྱུར་ཏོ།
en: Five thousand priests also arrived and gazed at the Bodhisattva’s countenance.

source: །དེ་ནས་ཤཱཀྱའི་རྒྱལ་པོ་བཟང་པོ་ཞེས་བྱ་བས་རྒྱན་ཇི་སྙེད་ཅིག་བྱས་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་བཏགས་ཏེ།
en: Then the ornaments that had been commissioned by the gracious king of the Śākyas were fastened onto the Bodhisattva’s body.

source: དེ་དག་ལུས་ལ་བཏགས་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་འོད་ཀྱིས་མོག་མོག་པོར་གྱུར་ནས་ལམ་མེར་མ་གྱུར། ལྷན་ནེར་མ་གྱུར། ལྷང་ངེར་མ་གྱུར་ཏེ།
en: As soon as the ornaments were placed on the Bodhisattva’s body, the radiance of his body eclipsed their luster. They did not glitter or gleam, and they lost all their shine.

source: འདི་ལྟ་སྟེ་དཔེར་ན། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་གན་དུ་སྣག་ཙའི་ཡུག་བཞག་ན་ལམ་མེར་མི་རུང་། ལྷན་ནེར་མི་རུང་། ལྷང་ངེར་མི་རུང་ངོ་།
en: They were just like a lump of coal that is placed next to gold from the Jambū River—it also does not glitter, gleam, or shine.

source: །དེ་བཞིན་དུ་རྒྱན་དེ་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ཀྱི་འོད་ཀྱིས་ཕོག་ན་ལམ་མེར་མི་རུང་། ལྷན་ནེར་མི་རུང་། ལྷང་ངེར་མི་རུང་ངོ་། །
en: In the same way, when the ornaments were struck by the light radiating from the Bodhisattva’s body, they lost all their glitter, gleam, and shine.

source: དེ་བཞིན་དུ་རྒྱན་གྱི་རྣམ་པ་གང་དང་གང་བྱང་ཆུབ་སེམས་དཔའི་ལུས་ལ་བཏགས་པ་དེ་དང་དེ་དག་མོག་མོག་པོར་གྱུར་ཏེ། འདི་ལྟ་སྟེ་དཔེར་ན། འཛམ་བུའི་ཆུ་བོའི་གསེར་གྱི་གན་དུ་སྣག་ཙའི་ཡུག་བཞག་པ་བཞིན་ནོ།
en: And thus it was that any ornament that was placed on the Bodhisattva’s body lost its luster, like a lump of soot thrown before gold from the Jambū River.

source: །དེའི་ཚེ་སྐྱེད་མོས་ཚལ་གྱི་ལྷ་མོ་དྲི་མ་མེད་པ་ཞེས་བྱ་བ་འདུག་པ་དེས་ལུས་ཆེན་པོ་བསྟན་ནས་མདུན་དུ་འདུག་སྟེ། རྒྱལ་པོ་ཟས་གཙང་མ་དང་ཤཱཀྱའི་ཚོགས་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: Then the goddess of the pleasure grove, Vimala, revealed her vast body before the king and the group of Śākyas, and spoke these verses to them:
